Revit 2027 API
NeutralMode Enumeration
An enumerated type to list the neutral mode for wire type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum NeutralMode
Public Enumeration NeutralMode
public enum class NeutralMode
type NeutralMode
Members
Member name | Value | Description
HotConductorSize | 0 | Neutral Mode is HotConductorSize.
UnbalancedCurrent | 1 | Neutral Mode is UnbalancedCurrent.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace